---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemNewBeamTypeParam
source: html/922d2768-7563-3210-3cc2-dd5b2196dd42.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemNewBeamTypeParam Property

"Beam Type"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemNewBeamTypeParam { get; }
```